_posts/2018-11-11-crazy-ideas-about-next-generation-io-hmi.html
---
layout: post
title: Crazy ideas about next generation input and output human machine interfaces
subtitle: 
tags: [steno, speed listening, ]
category: blog
---

<p>
One of the most powerful technologies human beings have developed is text, written text.
</p>

<p>
Writing is one of if not the most efficient way to communicate ideas.
</p>

<p>
Reading is one of if not the most efficient way to absorb ideas.
</p>

<div id="outline-container-org12f858b" class="outline-2">
<h2 id="org12f858b">Writing</h2>
<div class="outline-text-2" id="text-org12f858b">
<p>
People that know the most about fast and efficient ways to write are those who write the most, like stenographers.
</p>
</div>
<div id="outline-container-org09dcb43" class="outline-3">
<h3 id="org09dcb43">Making it mobile</h3>
<div class="outline-text-3" id="text-org09dcb43">
<p>
Work should be done addressing this issue.
The creator of OpenSteno has written a post about the issue.
Como se llama el puño americano para teclear?
</p>
</div>
</div>
</div>
<div id="outline-container-org8dd8dd4" class="outline-2">
<h2 id="org8dd8dd4">Reading</h2>
<div class="outline-text-2" id="text-org8dd8dd4">
<p>
Here I refer to the wonderful post by &#x2026; in TurnKeyLinux.
If we use speed listening, we can liberate the eyes. What about code?
</p>
</div>
<div id="outline-container-org765a28f" class="outline-3">
<h3 id="org765a28f">Making it mobile</h3>
<div class="outline-text-3" id="text-org765a28f">
<p>
Nothing special. Just earphones
</p>
</div>
</div>
</div>
